let datalist = [
  {},
  {},
  {},
  //三年级
  {
    ages: "3",
    pages: ["1-10", "11-20", "21-30", "31-34"],
    datatotals: [
      //分页内容 10个一个分页
      {
        //讲次内容
        classNumber: [
          //第1讲
          {
            className: "巧算加减法",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
          //第2讲
          {
            className: "乘除法巧算",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
          {
            className: "整数分拆",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
          {
            className: "等量代换",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2"],
          },
          {
            className: "巧填算符",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2"],
          },
          {
            className: "等差数列（一）",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2"],
          },
          {
            className: "简易方程",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1"],
          },
          {
            className: "枚举法（一）",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
          {
            className: "标数法",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4"],
          },
          {
            className: "几何计数（一）",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2"],
          },
        ],
      },
      //分页内容
      {
        //讲次内容
        classNumber: [
          //第1讲
          {
            className: "巧求周长",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
          //第2讲
          {
            className: "长方形和正方形的面积",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2"],
          },
          {
            className: "认识角",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4"],
          },
          {
            className: "点线排布",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4"],
          },
          {
            className: "平行四边形与梯形",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
          {
            className: "平均数（一）",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
          {
            className: "归一问题",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4"],
          },
          {
            className: "和倍问题",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4", "5", "6", "7"],
          },
          {
            className: "周期问题",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4", "5"],
          },
          {
            className: "盈亏问题",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
        ],
      },
      {
        //讲次内容
        classNumber: [
          //第1讲
          {
            className: "方阵问题",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
          //第2讲
          {
            className: "页码问题",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2"],
          },
          {
            className: "年龄问题",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
          //24讲
          {
            className: "还原问题",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
          {
            className: "简易方程解应用题",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4"],
          },
          {
            className: "鸡兔同笼",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
          {
            className: "初识行程",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4"],
          },
          {
            className: "奇数与偶数",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2"],
          },
          {
            className: "带余除法（一）",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4", "5"],
          },
          {
            className: "找规律－数列与图形",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2"],
          },
        ],
      },
      {
        //讲次内容
        classNumber: [
          //第1讲
          {
            className: "加减法数字谜",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
          //第2讲
          {
            className: "游戏中的数学",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
          {
            className: "有趣的多笔画",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2"],
          },
          {
            className: "逻辑推理（一）",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2"],
          },
        ],
      },
    ],
  },
  //四年级
  {
    ages: "4",
    pages: ["1-10", "11-20", "21-30", "31-34"],
    datatotals: [
      //分页内容 10个一个分页
      {
        //讲次内容
        classNumber: [
          //第1讲
          {
            className: "等差数列（二）",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4"],
          },
          //第2讲
          {
            className: "定义新运算（一）",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
          {
            className: "多位数的计算",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4"],
          },
          {
            className: "小数计算",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4"],
          },
          {
            className: "数表（一）",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
          {
            className: "整数巧算与等差数列",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4"],
          },
          {
            className: "方程及应用题",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2"],
          },
          {
            className: "几何计数（二）",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4", "5"],
          },
          {
            className: "容斥原理（一）",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
          {
            className: "枚举法",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4"],
          },
        ],
      },
      //分页内容
      {
        //讲次内容
        classNumber: [
          //第1讲
          {
            className: "加乘原理",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4"],
          },
          //第2讲
          {
            className: "三角形",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4", "5"],
          },
          {
            className: "图形的分割与剪拼",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4"],
          },
          {
            className: "等积变形",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
          {
            className: "一半模型",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4"],
          },
          {
            className: "格点与割补",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
          {
            className: "图形变换技巧",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4"],
          },
          {
            className: "平均数（二）",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2"],
          },
          {
            className: "相遇问题",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
          {
            className: "追及问题",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2"],
          },
        ],
      },
      {
        //讲次内容
        classNumber: [
          //第1讲
          {
            className: "环形跑道",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4"],
          },
          //第2讲
          {
            className: "火车过桥",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
          {
            className: "流水行船",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
          {
            className: "整除特征",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4"],
          },
          {
            className: "质数与合数（一）",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
          {
            className: "因数与倍数（一）",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
          {
            className: "逻辑推理（二）",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4"],
          },
          {
            className: "数独游戏",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4"],
          },
          {
            className: "数阵图（一）",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4"],
          },
          {
            className: "体育比赛中的数学",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4"],
          },
        ],
      },
      {
        //讲次内容
        classNumber: [
          //第1讲
          {
            className: "操作类智巧趣题",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4"],
          },
          //第2讲
          {
            className: "最值问题（一）",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
          {
            className: "数字谜（一）",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4", "5"],
          },
          {
            className: "统筹与规划",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4", "5"],
          },
        ],
      },
    ],
  },
  //五年级
  {
    ages: "5",
    pages: ["1-10", "11-20", "21-30", "31-40", "41-42"],
    datatotals: [
      //分页内容 10个一个分页
      {
        //讲次内容
        classNumber: [
          //第1讲
          {
            className: "分数乘除",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4", "5"],
          },
          //第2讲
          {
            className: "分数加减",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4", "5", "6"],
          },
          {
            className: "方程与方程组",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4", "5", "6"],
          },
          {
            className: "比和比例",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4"],
          },
          {
            className: "分数混合运算",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4", "5"],
          },
          {
            className: "定义新运算（二）",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4", "5", "6"],
          },
          {
            className: "循环小数",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4", "5"],
          },
          {
            className: "数表（二）",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4"],
          },
          {
            className: "比较与估算",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4", "5"],
          },
          {
            className: "容斥原理（二）",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4", "5"],
          },
        ],
      },
      //分页内容
      {
        //讲次内容
        classNumber: [
          //第1讲
          {
            className: "排列组合",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4", "5"],
          },
          //第2讲
          {
            className: "几何计数（三）",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4"],
          },
          {
            className: "列方程解应用题",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
          {
            className: "牛吃草",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4", "5"],
          },
          {
            className: "分数应用题",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4"],
          },
          {
            className: "工程问题（一）",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4"],
          },
          {
            className: "比例应用题（一）",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
          {
            className: "百分数应用题",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4", "5"],
          },
          {
            className: "电梯与发车",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4"],
          },
          {
            className: "钟表问题",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4", "5"],
          },
        ],
      },
      {
        //讲次内容
        classNumber: [
          //第1讲
          {
            className: "比例法解行程",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4"],
          },
          //第2讲
          {
            className: "等高模型",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4"],
          },
          {
            className: "勾股定理",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4", "5"],
          },
          {
            className: "鸟头模型",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
          {
            className: "蝴蝶模型",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
          {
            className: "正方体与长方体",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4"],
          },
          {
            className: "立体图形",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4"],
          },
          {
            className: "燕尾模型",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
          {
            className: "圆与扇形",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4"],
          },
          {
            className: "因数与倍数（二）",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4"],
          },
        ],
      },
      {
        //讲次内容
        classNumber: [
          //第1讲
          {
            className: "神奇的9",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
          //第2讲
          {
            className: "短除模型",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4"],
          },
          {
            className: "因数个数定理",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4"],
          },
          {
            className: "带余除法（二）",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4"],
          },
          {
            className: "完全平方数",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4", "5"],
          },
          {
            className: "同余",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
          {
            className: "不定方程",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4"],
          },
          {
            className: "棋盘中的数学",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4"],
          },
          {
            className: "必胜策略",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
          {
            className: "数字谜中的最值",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
        ],
      },
      {
        //讲次内容
        classNumber: [
          //第1讲
          {
            className: "最值问题（二）",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
          //第2讲
          {
            className: "抽屉原理（一）",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
        ],
      },
    ],
  },
  //六年级
  {
    ages: "6",
    pages: ["1-10", "11-20", "21-30", "31-34"],
    datatotals: [
      //分页内容 10个一个分页
      {
        //讲次内容
        classNumber: [
          //第1讲
          {
            className: "分数裂项",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
          //第2讲
          {
            className: "整数裂项与通项归纳",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2"],
          },
          {
            className: "计算公式综合",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
          {
            className: "计算模块综合",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
          {
            className: "计数模块综合",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
          {
            className: "切片与染色",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
          {
            className: "弦图",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
          {
            className: "特殊图形",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
          {
            className: "圆柱与圆锥",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
          {
            className: "复合图形分拆",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4", "5"],
          },
        ],
      },
      //分页内容
      {
        //讲次内容
        classNumber: [
          //第1讲
          {
            className: "旋转与轨迹",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4"],
          },
          //第2讲
          {
            className: "几何模块综合",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
          {
            className: "基础应用题综合",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4"],
          },
          {
            className: "比例应用题",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
          {
            className: "经济问题",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
          {
            className: "工程问题（二）",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
          {
            className: "浓度问题",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
          {
            className: "应用题模块综合",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4"],
          },
          {
            className: "多次相遇与追及",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4", "5"],
          },
          {
            className: "变速问题",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4"],
          },
        ],
      },
      {
        //讲次内容
        classNumber: [
          //第1讲
          {
            className: "行程模块综合",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4"],
          },
          //第2讲
          {
            className: "韩信点兵",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4", "5"],
          },
          {
            className: "数论中的规律",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4", "5"],
          },
          {
            className: "数论中的组合",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4"],
          },
          {
            className: "数论模块综合",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4"],
          },
          {
            className: "归纳与递推",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4"],
          },
          {
            className: "立逻辑推理（三）",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4"],
          },
          {
            className: "从整体考虑",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4", "5"],
          },
          {
            className: "最值问题（三）",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
          {
            className: "算两次",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
        ],
      },
      {
        //讲次内容
        classNumber: [
          //第1讲
          {
            className: "从极端考虑",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
          //第2讲
          {
            className: "数形结合",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3"],
          },
          {
            className: "数字谜（二）",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2"],
          },
          {
            className: "抽屉原理（二）",
            //每一讲里面有几题视频 就写到几
            classTimu: ["1", "2", "3", "4"],
          },
        ],
      },
    ],
  },
];
